[Killed] ConditionalExpression
src/operacoes.js:12:7
   return a * b;
 }
 function divisao(a, b) {
-  if (b === 0) throw new Error("Divisão por zero não é permitida.");
+  if (false) throw new Error("Divisão por zero não é permitida.");
   return a / b;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Divisão por zero"

Received function did not throw

[Killed] BlockStatement
src/operacoes.js:19:26
   return Math.pow(base, expoente);
 }
 
-function raizQuadrada(n) {
-  if (typeof n !== "number") throw new Error("Entrada inválida.");
-  if (n < 0)
-    throw new Error(
-      "Não é possível calcular a raiz quadrada de um número negativo."
-    );
-  return Math.sqrt(n);
-}
+function raizQuadrada(n) {}
 
 function restoDivisao(dividendo, divisor) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:20:7
 }
 
 function raizQuadrada(n) {
-  if (typeof n !== "number") throw new Error("Entrada inválida.");
+  if (true) throw new Error("Entrada inválida.");
   if (n < 0)
     throw new Error(
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: Entrada inválida.

[Killed] ConditionalExpression
src/operacoes.js:20:7
 }
 
 function raizQuadrada(n) {
-  if (typeof n !== "number") throw new Error("Entrada inválida.");
+  if (false) throw new Error("Entrada inválida.");
   if (n < 0)
     throw new Error(
killedBy: Testes extras para cobrir mutações sobreviventes raizQuadrada deve lançar erro para entrada não numérica
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:21:7
 
 function raizQuadrada(n) {
   if (typeof n !== "number") throw new Error("Entrada inválida.");
-  if (n < 0)
+  if (false)
     throw new Error(
       "Não é possível calcular a raiz quadrada de um número negativo."
killedBy: Testes adicionais para validações e bordas de comparação raizQuadrada deve lançar erro para número negativo
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/operacoes.js:21:7
 
 function raizQuadrada(n) {
   if (typeof n !== "number") throw new Error("Entrada inválida.");
-  if (n < 0)
+  if (n >= 0)
     throw new Error(
       "Não é possível calcular a raiz quadrada de um número negativo."
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: Não é possível calcular a raiz quadrada de um número negativo.

[Killed] BlockStatement
src/operacoes.js:28:43
   return Math.sqrt(n);
 }
 
-function restoDivisao(dividendo, divisor) {
-  return dividendo % divisor;
-}
+function restoDivisao(dividendo, divisor) {}
 
 function fatorial(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 7. deve retornar o resto da divisão
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/operacoes.js:32:22
   return dividendo % divisor;
 }
 
-function fatorial(n) {
-  if (typeof n !== "number") throw new Error("Entrada inválida.");
-  if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
-  if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) resultado *= i;
-  return resultado;
-}
+function fatorial(n) {}
 
 function mediaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:33:7
 }
 
 function fatorial(n) {
-  if (typeof n !== "number") throw new Error("Entrada inválida.");
+  if (true) throw new Error("Entrada inválida.");
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: Entrada inválida.

[Killed] ConditionalExpression
src/operacoes.js:33:7
 }
 
 function fatorial(n) {
-  if (typeof n !== "number") throw new Error("Entrada inválida.");
+  if (false) throw new Error("Entrada inválida.");
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
killedBy: Testes adicionais para validações e bordas de comparação fatorial deve lançar erro com mensagem 'Entrada inválida' para entrada não numérica
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Entrada inválida"

Received function did not throw

[Killed] EqualityOperator
src/operacoes.js:34:7
 
 function fatorial(n) {
   if (typeof n !== "number") throw new Error("Entrada inválida.");
-  if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
+  if (n <= 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Testes extras para cobrir mutações sobreviventes fatorial deve retornar 1 para entrada 0
statusReason: Error: Fatorial não é definido para números negativos.

[Killed] ConditionalExpression
src/operacoes.js:34:7
 
 function fatorial(n) {
   if (typeof n !== "number") throw new Error("Entrada inválida.");
-  if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
+  if (false) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Testes adicionais para validações e bordas de comparação fatorial deve lançar erro com mensagem 'Fatorial não é definido para números negativos.' para número negativo
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Fatorial não é definido para números negativos."

Received function did not throw

[Killed] EqualityOperator
src/operacoes.js:37:19
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) resultado *= i;
+  for (let i = 2; i > n; i++) resultado *= i;
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:37:19
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) resultado *= i;
+  for (let i = 2; i < n; i++) resultado *= i;
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 6

[Killed] BlockStatement
src/operacoes.js:41:30
   return resultado;
 }
 
-function mediaArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0) return 0;
-  return somaArray(numeros) / numeros.length;
-}
+function mediaArray(numeros) {}
 
 function somaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:42:7
 }
 
 function mediaArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (true) throw new Error("Entrada inválida.");
   if (numeros.length === 0) return 0;
   return somaArray(numeros) / numeros.length;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: Entrada inválida.

[Killed] BooleanLiteral
src/operacoes.js:42:7
 }
 
 function mediaArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (Array.isArray(numeros)) throw new Error("Entrada inválida.");
   if (numeros.length === 0) return 0;
   return somaArray(numeros) / numeros.length;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: Entrada inválida.

[Killed] ConditionalExpression
src/operacoes.js:43:7
 
 function mediaArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0) return 0;
+  if (true) return 0;
   return somaArray(numeros) / numeros.length;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:43:7
 
 function mediaArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0) return 0;
+  if (false) return 0;
   return somaArray(numeros) / numeros.length;
 }
killedBy: Testes adicionais para validações e bordas de comparação mediaArray deve retornar 0 para array vazio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] BlockStatement
src/operacoes.js:47:29
   return somaArray(numeros) / numeros.length;
 }
 
-function somaArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  return numeros.reduce((acc, val) => acc + val, 0);
-}
+function somaArray(numeros) {}
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: NaN

[Killed] BooleanLiteral
src/operacoes.js:48:7
 }
 
 function somaArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (Array.isArray(numeros)) throw new Error("Entrada inválida.");
   return numeros.reduce((acc, val) => acc + val, 0);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: Entrada inválida.

[Killed] ConditionalExpression
src/operacoes.js:48:7
 }
 
 function somaArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (true) throw new Error("Entrada inválida.");
   return numeros.reduce((acc, val) => acc + val, 0);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: Entrada inválida.

[Killed] ArithmeticOperator
src/operacoes.js:49:39
 
 function somaArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  return numeros.reduce((acc, val) => acc + val, 0);
+  return numeros.reduce((acc, val) => acc - val, 0);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: -20

[Killed] ArrowFunction
src/operacoes.js:49:25
 
 function somaArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  return numeros.reduce((acc, val) => acc + val, 0);
+  return numeros.reduce(() => undefined, 0);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: NaN

[Killed] BlockStatement
src/operacoes.js:53:31
 }
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
-function maximoArray(numeros) {
-  if (!Array.isArray(numeros) || numeros.length === 0)
-    throw new Error("Array vazio não possui valor máximo.");
-  return Math.max(...numeros);
-}
+function maximoArray(numeros) {}
 
 function minimoArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] LogicalOperator
src/operacoes.js:54:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (!Array.isArray(numeros) || numeros.length === 0)
+  if (!Array.isArray(numeros) && numeros.length === 0)
     throw new Error("Array vazio não possui valor máximo.");
   return Math.max(...numeros);
killedBy: Testes adicionais para validações e bordas de comparação maximoArray deve lançar erro com mensagem correta para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio"

Received function did not throw

[Killed] BooleanLiteral
src/operacoes.js:54:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (!Array.isArray(numeros) || numeros.length === 0)
+  if (Array.isArray(numeros) || numeros.length === 0)
     throw new Error("Array vazio não possui valor máximo.");
   return Math.max(...numeros);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: Array vazio não possui valor máximo.

[Killed] MethodExpression
src/operacoes.js:56:10
 function maximoArray(numeros) {
   if (!Array.isArray(numeros) || numeros.length === 0)
     throw new Error("Array vazio não possui valor máximo.");
-  return Math.max(...numeros);
+  return Math.min(...numeros);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 1

[Killed] BlockStatement
src/operacoes.js:59:31
   return Math.max(...numeros);
 }
 
-function minimoArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0)
-    throw new Error("Array vazio não possui valor mínimo.");
-  return Math.min(...numeros);
-}
+function minimoArray(numeros) {}
 
 function valorAbsoluto(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BooleanLiteral
src/operacoes.js:60:7
 }
 
 function minimoArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (Array.isArray(numeros)) throw new Error("Entrada inválida.");
   if (numeros.length === 0)
     throw new Error("Array vazio não possui valor mínimo.");
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: Entrada inválida.

[Killed] ConditionalExpression
src/operacoes.js:60:7
 }
 
 function minimoArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (false) throw new Error("Entrada inválida.");
   if (numeros.length === 0)
     throw new Error("Array vazio não possui valor mínimo.");
killedBy: Testes extras para cobrir mutações sobreviventes minimoArray deve lançar erro com mensagem 'Entrada inválida' para tipo inválido
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Entrada inválida"
Received message:   "Spread syntax requires ...iterable[Symbol.iterator] to be a function"

      156 |     if (stryMutAct_9fa48("77") ? false : stryMutAct_9fa48("76") ? true : stryMutAct_9fa48("75") ? Array.isArray(numeros) : (stryCov_9fa48("75", "76", "77"), !Array.isArray(numeros))) throw new Error(stryMutAct_9fa4

[Killed] EqualityOperator
src/operacoes.js:61:7
 
 function minimoArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0)
+  if (numeros.length !== 0)
     throw new Error("Array vazio não possui valor mínimo.");
   return Math.min(...numeros);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: Array vazio não possui valor mínimo.

[Killed] ConditionalExpression
src/operacoes.js:61:7
 
 function minimoArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0)
+  if (false)
     throw new Error("Array vazio não possui valor mínimo.");
   return Math.min(...numeros);
killedBy: Testes extras para cobrir mutações sobreviventes minimoArray deve lançar erro com mensagem 'Array vazio' para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio"

Received function did not throw

[Killed] StringLiteral
src/operacoes.js:62:21
 function minimoArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
   if (numeros.length === 0)
-    throw new Error("Array vazio não possui valor mínimo.");
+    throw new Error("");
   return Math.min(...numeros);
 }
killedBy: Testes extras para cobrir mutações sobreviventes minimoArray deve lançar erro com mensagem 'Array vazio' para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio"
Received message:   ""

      155 |     stryCov_9fa48("74");
      156 |     if (stryMutAct_9fa48("77") ? false : stryMutAct_9fa48("76") ? true : stryMutAct_9fa48("75") ? Array.isArray(numeros) : (stryCov_9fa48("75", "76", "77"), !Array.isArray(numeros))) throw new Error(stryMutAct_9fa48("78") ? "" : (stryCov_9fa48("78"),

[Killed] MethodExpression
src/operacoes.js:63:10
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
   if (numeros.length === 0)
     throw new Error("Array vazio não possui valor mínimo.");
-  return Math.min(...numeros);
+  return Math.max(...numeros);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 100

[Killed] BlockStatement
src/operacoes.js:66:27
   return Math.min(...numeros);
 }
 
-function valorAbsoluto(n) {
-  return Math.abs(n);
-}
+function valorAbsoluto(n) {}
 function arredondar(n) {
   return Math.round(n);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 13. deve retornar o valor absoluto de um número negativo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:73:10
   return Math.round(n);
 }
 function isPar(n) {
-  return n % 2 === 0;
+  return false;
 }
 function isImpar(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:76:10
   return n % 2 === 0;
 }
 function isImpar(n) {
-  return n % 2 !== 0;
+  return true;
 }
 function calcularPorcentagem(percentual, valor) {
killedBy: Testes adicionais para validações e bordas de comparação isImpar deve retornar falso para número par negativo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/operacoes.js:85:10
   return valor * (1 + percentual / 100);
 }
 function diminuirPorcentagem(valor, percentual) {
-  return valor * (1 - percentual / 100);
+  return valor / (1 - percentual / 100);
 }
 function inverterSinal(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: 111.11111111111111

Expected precision:    2
Expected difference: < 0.005
Received difference:   21.111111111111114

[Killed] BlockStatement
src/operacoes.js:124:20
 }
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
-function mdc(a, b) {
-  while (b) [a, b] = [b, a % b];
-  return a;
-}
+function mdc(a, b) {}
 function mmc(a, b) {
   return Math.abs(a * b) / mdc(a, b);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 31. deve calcular o MDC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:125:10
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) {
-  while (b) [a, b] = [b, a % b];
+  while (false) [a, b] = [b, a % b];
   return a;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 31. deve calcular o MDC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Timeout] ArithmeticOperator
src/operacoes.js:125:26
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) {
-  while (b) [a, b] = [b, a % b];
+  while (b) [a, b] = [b, a * b];
   return a;
 }

[Killed] BlockStatement
src/operacoes.js:128:20
   while (b) [a, b] = [b, a % b];
   return a;
 }
-function mmc(a, b) {
-  return Math.abs(a * b) / mdc(a, b);
-}
+function mmc(a, b) {}
 function isPrimo(n) {
   if (n <= 1) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:129:10
   return a;
 }
 function mmc(a, b) {
-  return Math.abs(a * b) / mdc(a, b);
+  return Math.abs(a * b) * mdc(a, b);
 }
 function isPrimo(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 250

[Killed] ArithmeticOperator
src/operacoes.js:129:19
   return a;
 }
 function mmc(a, b) {
-  return Math.abs(a * b) / mdc(a, b);
+  return Math.abs(a / b) / mdc(a, b);
 }
 function isPrimo(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0.4

[Killed] BlockStatement
src/operacoes.js:131:21
 function mmc(a, b) {
   return Math.abs(a * b) / mdc(a, b);
 }
-function isPrimo(n) {
-  if (n <= 1) return false;
-  for (let i = 2; i <= Math.sqrt(n); i++) {
-    if (n % i === 0) return false;
-  }
-  return true;
-}
+function isPrimo(n) {}
 function fibonacci(n) {
   if (n <= 1) return n;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:133:19
 }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i <= Math.sqrt(n); i++) {
+  for (let i = 2; false; i++) {
     if (n % i === 0) return false;
   }
killedBy: Testes adicionais para validações e bordas de comparação isPrimo deve retornar falso para números compostos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:133:19
 }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i <= Math.sqrt(n); i++) {
+  for (let i = 2; i > Math.sqrt(n); i++) {
     if (n % i === 0) return false;
   }
killedBy: Testes adicionais para validações e bordas de comparação isPrimo deve retornar falso para números compostos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/operacoes.js:134:29
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i <= Math.sqrt(n); i++) {
-    if (n % i === 0) return false;
+    if (n % i === 0) return true;
   }
   return true;
killedBy: Testes adicionais para validações e bordas de comparação isPrimo deve retornar falso para números compostos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:134:9
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i <= Math.sqrt(n); i++) {
-    if (n % i === 0) return false;
+    if (n % i !== 0) return false;
   }
   return true;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:138:23
   }
   return true;
 }
-function fibonacci(n) {
-  if (n <= 1) return n;
-  return fibonacci(n - 1) + fibonacci(n - 2);
-}
+function fibonacci(n) {}
 function produtoArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:139:7
   return true;
 }
 function fibonacci(n) {
-  if (n <= 1) return n;
+  if (n < 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: -55

[Killed] ConditionalExpression
src/operacoes.js:139:7
   return true;
 }
 function fibonacci(n) {
-  if (n <= 1) return n;
+  if (true) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 10

[Killed] BlockStatement
src/operacoes.js:142:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   if (valor < min) return min;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:143:7
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (true) throw new Error("Entrada inválida.");
   if (numeros.length === 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: Entrada inválida.

[Killed] BooleanLiteral
src/operacoes.js:143:7
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-  if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
+  if (Array.isArray(numeros)) throw new Error("Entrada inválida.");
   if (numeros.length === 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: Entrada inválida.

[Killed] EqualityOperator
src/operacoes.js:144:7
 }
 function produtoArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0) return 1;
+  if (numeros.length !== 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:144:7
 }
 function produtoArray(numeros) {
   if (!Array.isArray(numeros)) throw new Error("Entrada inválida.");
-  if (numeros.length === 0) return 1;
+  if (true) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ArithmeticOperator
src/operacoes.js:153:10
   return valor;
 }
 function isDivisivel(dividendo, divisor) {
-  return dividendo % divisor === 0;
+  return dividendo * divisor === 0;
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 37. deve verificar se um número é divisível por outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
