[Killed] BlockStatement
src/operacoes.js:156:41
   return dividendo % divisor === 0;
 }
 
-function celsiusParaFahrenheit(celsius) {
-  return (celsius * 9) / 5 + 32;
-}
+function celsiusParaFahrenheit(celsius) {}
 function fahrenheitParaCelsius(fahrenheit) {
   return ((fahrenheit - 32) * 5) / 9;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 38. deve converter Celsius para Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:157:10
 }
 
 function celsiusParaFahrenheit(celsius) {
-  return (celsius * 9) / 5 + 32;
+  return celsius * 9 * 5 + 32;
 }
 function fahrenheitParaCelsius(fahrenheit) {
killedBy: Testes extras para cobrir mutações sobreviventes celsiusParaFahrenheit e fahrenheitParaCelsius devem ser inversos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 25
Received: 625

Expected precision:    2
Expected difference: < 0.005
Received difference:   600

[Killed] ArithmeticOperator
src/operacoes.js:160:11
   return (celsius * 9) / 5 + 32;
 }
 function fahrenheitParaCelsius(fahrenheit) {
-  return ((fahrenheit - 32) * 5) / 9;
+  return ((fahrenheit - 32) / 5) / 9;
 }
 
killedBy: Testes extras para cobrir mutações sobreviventes celsiusParaFahrenheit e fahrenheitParaCelsius devem ser inversos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 25
Received: 1

Expected precision:    2
Expected difference: < 0.005
Received difference:   24

[Killed] BlockStatement
src/operacoes.js:163:21
   return ((fahrenheit - 32) * 5) / 9;
 }
 
-function inverso(n) {
-  if (n === 0) throw new Error("Não é possível inverter o número zero.");
-  return 1 / n;
-}
+function inverso(n) {}
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:164:7
 }
 
 function inverso(n) {
-  if (n === 0) throw new Error("Não é possível inverter o número zero.");
+  if (true) throw new Error("Não é possível inverter o número zero.");
   return 1 / n;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: Não é possível inverter o número zero.

[Killed] BlockStatement
src/operacoes.js:179:27
   return 2 * (base + altura);
 }
 
-function isMaiorQue(a, b) {
-  return a > b;
-}
+function isMaiorQue(a, b) {}
 function isMenorQue(a, b) {
   return a < b;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 44. deve verificar se um número é maior que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:180:10
 }
 
 function isMaiorQue(a, b) {
-  return a > b;
+  return a <= b;
 }
 function isMenorQue(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 44. deve verificar se um número é maior que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:180:10
 }
 
 function isMaiorQue(a, b) {
-  return a > b;
+  return true;
 }
 function isMenorQue(a, b) {
killedBy: Testes adicionais para validações e bordas de comparação isMaiorQue deve retornar falso quando números forem iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:183:10
   return a > b;
 }
 function isMenorQue(a, b) {
-  return a < b;
+  return a >= b;
 }
 function isEqual(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 45. deve verificar se um número é menor que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:189:32
   return a === b;
 }
 
-function medianaArray(numeros) {
-  if (!Array.isArray(numeros) || numeros.length === 0)
-    throw new Error("Array vazio não possui mediana.");
-  const sorted = [...numeros].sort((a, b) => a - b);
-  const meio = Math.floor(sorted.length / 2);
-  return sorted.length % 2 === 0
-    ? (sorted[meio - 1] + sorted[meio]) / 2
-    : sorted[meio];
-}
+function medianaArray(numeros) {}
 
 function dobro(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:190:34
 }
 
 function medianaArray(numeros) {
-  if (!Array.isArray(numeros) || numeros.length === 0)
+  if (!Array.isArray(numeros) || numeros.length !== 0)
     throw new Error("Array vazio não possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: Array vazio não possui mediana.

[Killed] ConditionalExpression
src/operacoes.js:190:7
 }
 
 function medianaArray(numeros) {
-  if (!Array.isArray(numeros) || numeros.length === 0)
+  if (false)
     throw new Error("Array vazio não possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
killedBy: Testes adicionais para validações e bordas de comparação medianaArray deve lançar erro com mensagem correta para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio"

Received function did not throw

[Killed] ArrowFunction
src/operacoes.js:192:36
 function medianaArray(numeros) {
   if (!Array.isArray(numeros) || numeros.length === 0)
     throw new Error("Array vazio não possui mediana.");
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros].sort(() => undefined);
   const meio = Math.floor(sorted.length / 2);
   return sorted.length % 2 === 0
killedBy: Testes adicionais para validações e bordas de comparação medianaArray deve calcular corretamente array não ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] MethodExpression
src/operacoes.js:192:18
 function medianaArray(numeros) {
   if (!Array.isArray(numeros) || numeros.length === 0)
     throw new Error("Array vazio não possui mediana.");
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros];
   const meio = Math.floor(sorted.length / 2);
   return sorted.length % 2 === 0
killedBy: Testes adicionais para validações e bordas de comparação medianaArray deve calcular corretamente array não ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/operacoes.js:193:27
   if (!Array.isArray(numeros) || numeros.length === 0)
     throw new Error("Array vazio não possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
-  const meio = Math.floor(sorted.length / 2);
+  const meio = Math.floor(sorted.length * 2);
   return sorted.length % 2 === 0
     ? (sorted[meio - 1] + sorted[meio]) / 2
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:194:10
     throw new Error("Array vazio não possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
   const meio = Math.floor(sorted.length / 2);
-  return sorted.length % 2 === 0
+  return false
     ? (sorted[meio - 1] + sorted[meio]) / 2
     : sorted[meio];
killedBy: Testes adicionais para validações e bordas de comparação medianaArray deve calcular corretamente array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 3

[Killed] ArithmeticOperator
src/operacoes.js:194:10
     throw new Error("Array vazio não possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
   const meio = Math.floor(sorted.length / 2);
-  return sorted.length % 2 === 0
+  return sorted.length * 2 === 0
     ? (sorted[meio - 1] + sorted[meio]) / 2
     : sorted[meio];
killedBy: Testes adicionais para validações e bordas de comparação medianaArray deve calcular corretamente array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 3

[Killed] ArithmeticOperator
src/operacoes.js:195:7
   const sorted = [...numeros].sort((a, b) => a - b);
   const meio = Math.floor(sorted.length / 2);
   return sorted.length % 2 === 0
-    ? (sorted[meio - 1] + sorted[meio]) / 2
+    ? (sorted[meio - 1] + sorted[meio]) * 2
     : sorted[meio];
 }
killedBy: Testes adicionais para validações e bordas de comparação medianaArray deve calcular corretamente array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 10

[Killed] ArithmeticOperator
src/operacoes.js:195:8
   const sorted = [...numeros].sort((a, b) => a - b);
   const meio = Math.floor(sorted.length / 2);
   return sorted.length % 2 === 0
-    ? (sorted[meio - 1] + sorted[meio]) / 2
+    ? (sorted[meio - 1] - sorted[meio]) / 2
     : sorted[meio];
 }
killedBy: Testes adicionais para validações e bordas de comparação medianaArray deve calcular corretamente array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: -0.5

[Killed] BlockStatement
src/operacoes.js:199:19
     : sorted[meio];
 }
 
-function dobro(n) {
-  return n * 2;
-}
+function dobro(n) {}
 function triplo(n) {
   return n * 3;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 48. deve calcular o dobro de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined
